app/Controllers/Principal.php

    public function verifyUser()
    {
        try {
            $user = $this->users->where([
                'users_email' => $this->request->getPost('users_email'),
                'users_contrasenia' => $this->request->getPost('users_contrasenia'),
                'users_estado' => 1
            ])->first();
---
SELECT *
FROM `tbl_users`
WHERE `users_email` = 'jarboleda@gmail.com'
AND `users_contrasenia` = '1234'
AND `users_estado` = 1
 LIMIT 1