app/Controllers/SyncEncuesta.php

SELECT *
FROM `tbl_users`
WHERE `users_cedula` = '100200360'
---
    public function sync()
    {
        log_message('error', '🔥 LOG DE PRUEBA: SyncEncuesta ejecutado');

        // 1️⃣ Leer JSON
        $data = $this->request->getJSON(true);
        log_message('error', 'JSON RECIBIDO: ' . print_r($data, true));
        log_message('error', 'CONTENT TYPE: ' . $this->request->getHeaderLine('Content-Type'));

        if (!$data) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'No JSON received'
            ])->setStatusCode(400);
        }

        $cedula = $data['datos_cedula_voluntario'] ?? null;

        // 2️⃣ Conexión a DB
        $db = \Config\Database::connect();

        // 🔎 Buscar usuario por cédula
        $user = $db->table('tbl_users')
            ->where('users_cedula', $cedula)
            ->get()
            ->getRow();

SELECT *
FROM `tbl_item_catalogo`
WHERE `id_item` = 2
AND `id_catalogo` = 18
AND `itc_estado` = 1
---
        $provincia_id = (int) $provincia_id;

        // ✅ Validar contra catálogo PROVINCIAS (18)
        $provincia = $db->table('tbl_item_catalogo')
            ->where('id_item', $provincia_id)
            ->where('id_catalogo', 18)
            ->where('itc_estado', 1)
            ->get()
            ->getRow();

INSERT INTO `tbl_datos_generales` (`id_users`, `datos_provincia`, `datos_canton`, `datos_parroquias`, `datos_tipo_parroquias`, `datos_comunidades`, `datos_barrios`, `datos_tipo_viviendas`, `datos_techos`, `datos_paredes`, `datos_pisos`, `datos_cuarto`, `datos_combustibles_cocina`, `datos_servicios_higienicos`, `datos_viviendas`, `datos_pago_vivienda`, `datos_agua`, `datos_pago_agua`, `datos_pago_luz`, `datos_cantidad_luz`, `datos_internet`, `datos_pago_internet`, `datos_tv_cable`, `datos_tv_pago`, `datos_eliminacion_basura`, `datos_lugares_mayor_frecuencia_viveres`, `datos_gastos_viveres_alimentacion`, `datos_medio_transporte`, `datos_estado_transporte`, `datos_terrenos`, `datos_celular`, `datos_cantidad_celulare`, `datos_plan_celular`, `datos_observacion`, `datos_resultado`, `datos_resultado_sistema`, `datos_consentimiento`) VALUES ('18', 2, 10, 141, 20, '100200360', '100200360', 168, 172, 176, 181, 100200360, 187, 191, 196, 100, 202, 44, 4, 4, 1, 44, 0, 0, 217, 222, 4, 'Moto', 'Bueno', 1, 0, 0, 0, '4', NULL, 'Sincronizado', 1)
---
            'datos_consentimiento' => $data['datos_consentimiento'] ?? null,
        ];

        $db->table('tbl_datos_generales')->insert($generalData);

INSERT INTO `tbl_datos_parentesco` (`datos_parentesco_nombres`, `datos_parentesco_apellidos`, `datos_parentesco_documento`, `datos_parentesco_celular_telf`, `datos_parentesco_etnia`, `datos_parentesco_genero`, `datos_parentesco_nivel_educacion`, `datos_parentesco_fecha_de_nacimiento`, `datos_parentesco_edad`, `datos_parentesco_estado_civil`, `datos_parentesco_discapacidad`, `datos_parentesco_enfermedad_catastrofica`, `datos_parentesco_trabaja`, `datos_parentesco_ocupacion`, `datos_parentesco_ingreso_mensual`, `datos_parentesco_parentesco`) VALUES ('juan pere pueba1', 'juan pere pueba1', '100200360', '100200360', 239, 243, 249, '2025-12-26', 100200360, 251, 'Sí', '360', 'No', '', 100200360, '100200360')
---
            foreach ($data['familiares'] as $i => $familiar) {
                log_message('error','FECHA RECIBIDA MYSQL => ' . var_export($familiar['fecha_nacimiento'], true));

                $db->table('tbl_datos_parentesco')->insert([
                    'datos_parentesco_nombres' => $familiar['nombres'] ?? null,
                    'datos_parentesco_apellidos' => $familiar['apellidos'] ?? null,
                    'datos_parentesco_documento' => $familiar['documento'] ?? null,
                    'datos_parentesco_celular_telf' => $familiar['telefono'] ?? null,
                    'datos_parentesco_etnia' => $familiar['etnia'] ?? null,
                    'datos_parentesco_genero' => $familiar['genero'] ?? null,
                    'datos_parentesco_nivel_educacion' => $familiar['nivel_educacion'] ?? null,
                    'datos_parentesco_fecha_de_nacimiento' => $familiar['fecha_nacimiento'] ?? null,
                    'datos_parentesco_edad' => $familiar['edad'] ?? null,
                    'datos_parentesco_estado_civil' => $familiar['estado_civil'] ?? null,
                    'datos_parentesco_discapacidad' => $familiar['discapacidad'] ?? null,
                    'datos_parentesco_enfermedad_catastrofica' => $familiar['enfermedad'] ?? null,
                    'datos_parentesco_trabaja' => $familiar['trabaja'] ?? null,
                    'datos_parentesco_ocupacion' => $familiar['ocupacion'] ?? null,
                    'datos_parentesco_ingreso_mensual' => $familiar['ingreso'] ?? null,
                    'datos_parentesco_parentesco' => $familiar['parentesco'] ?? null,
                ]);

INSERT INTO `tbl_datos_generales_parentesco` (`id_datos_generales`, `id_datos_parentescos`) VALUES (164, 110)
---
                $idParentesco = $db->insertID();

                // 🔗 Relación
                $db->table('tbl_datos_generales_parentesco')->insert([
                    'id_datos_generales' => $idGeneral,
                    'id_datos_parentescos' => $idParentesco
                ]);

UPDATE `tbl_datos_generales` SET `datos_parentesco_id` = 110
WHERE `id_datos_generales` = 164
---

        // 5️⃣ Actualizar primer parentesco
        if ($primerParentescoId) {
            $db->table('tbl_datos_generales')
                ->where('id_datos_generales', $idGeneral)
                ->update(['datos_parentesco_id' => $primerParentescoId]);