app/Models/ItemCatalogMod.php

    public function obtainActiveProvinces()
    {
        return $this->select('
            tbl_item_catalogo.id_item,
            tbl_item_catalogo.itc_codigo,
            tbl_item_catalogo.itc_nombre,
            tbl_item_catalogo.itc_descripcion,
            tbl_item_catalogo.itc_estado,
            tbl_catalogo.id_catalogo,
            tbl_catalogo.cat_codigo,
            tbl_catalogo.cat_nombre
        ')
            ->join('tbl_catalogo', 'tbl_catalogo.id_catalogo = tbl_item_catalogo.id_catalogo')
            ->where('tbl_catalogo.cat_codigo', 'PROV')
            ->where('tbl_catalogo.ca_estado', 1)
            ->where('tbl_item_catalogo.itc_estado', 1)
            ->findAll();
---
SELECT `tbl_item_catalogo`.`id_item`, `tbl_item_catalogo`.`itc_codigo`, `tbl_item_catalogo`.`itc_nombre`, `tbl_item_catalogo`.`itc_descripcion`, `tbl_item_catalogo`.`itc_estado`, `tbl_catalogo`.`id_catalogo`, `tbl_catalogo`.`cat_codigo`, `tbl_catalogo`.`cat_nombre`
FROM `tbl_item_catalogo`
JOIN `tbl_catalogo` ON `tbl_catalogo`.`id_catalogo` = `tbl_item_catalogo`.`id_catalogo`
WHERE `tbl_catalogo`.`cat_codigo` = 'PROV'
AND `tbl_catalogo`.`ca_estado` = 1
AND `tbl_item_catalogo`.`itc_estado` = 1

    public function obtainActiveParishes()
    {
        return $this->select('
            tbl_item_catalogo.id_item,
            tbl_item_catalogo.itc_codigo,
            tbl_item_catalogo.itc_nombre,
            tbl_item_catalogo.itc_descripcion,
            tbl_item_catalogo.itc_estado,
            tbl_catalogo.id_catalogo,
            tbl_catalogo.cat_codigo,
            tbl_catalogo.cat_nombre
        ')
            ->join('tbl_catalogo', 'tbl_catalogo.id_catalogo = tbl_item_catalogo.id_catalogo')
            ->where('tbl_catalogo.cat_codigo', 'PARR')
            ->where('tbl_catalogo.ca_estado', 1)
            ->where('tbl_item_catalogo.itc_estado', 1)
            ->findAll();
---
SELECT `tbl_item_catalogo`.`id_item`, `tbl_item_catalogo`.`itc_codigo`, `tbl_item_catalogo`.`itc_nombre`, `tbl_item_catalogo`.`itc_descripcion`, `tbl_item_catalogo`.`itc_estado`, `tbl_catalogo`.`id_catalogo`, `tbl_catalogo`.`cat_codigo`, `tbl_catalogo`.`cat_nombre`
FROM `tbl_item_catalogo`
JOIN `tbl_catalogo` ON `tbl_catalogo`.`id_catalogo` = `tbl_item_catalogo`.`id_catalogo`
WHERE `tbl_catalogo`.`cat_codigo` = 'PARR'
AND `tbl_catalogo`.`ca_estado` = 1
AND `tbl_item_catalogo`.`itc_estado` = 1