app/Models/RolAccessMod.php

SELECT `f`.`funcionalidad_url`
FROM `tbl_rol_access` `ra`
JOIN `tbl_funcionalidad` `f` ON `f`.`id_funcionalidad` = `ra`.`id_funcionalidad`
WHERE `ra`.`id_rol` = '3'
AND `f`.`funcionalidad_estado` = 1
---
    public function getUrlsByRolId($id_rol)
    {
        return $this->db->table('tbl_rol_access ra')
            ->select('f.funcionalidad_url')
            ->join('tbl_funcionalidad f', 'f.id_funcionalidad = ra.id_funcionalidad')
            ->where('ra.id_rol', $id_rol)
            ->where('f.funcionalidad_estado', 1) // opcional: solo activas
            ->get()
            ->getResultArray();