app/Models/UsersMod.php

SELECT `u`.`id_users`, `u`.`users_cedula`
FROM `tbl_users` `u`
WHERE `u`.`users_cedula` = '1725417331'
 LIMIT 1
---
    public function searchUserDocument($document)
    {
        return $this->db->table('tbl_users u')
            ->select('u.id_users, u.users_cedula')
            ->where('u.users_cedula', $document)
            ->limit(1)
            ->get()
            ->getResult();

SELECT `u`.`id_users`, `u`.`users_nombre`, `u`.`users_apellido`, `u`.`users_cedula`, `u`.`users_email`, `u`.`users_genero`, `u`.`users_nombreUsuario`, `u`.`users_telefono`, `u`.`users_fecha_de_nacimiento`, `u`.`users_estado`, `r`.`id_rol`, `r`.`rol_nombre`
FROM `tbl_user_rol` `ur`
JOIN `tbl_users` `u` ON `u`.`id_users` = `ur`.`id_users`
JOIN `tbl_rol` `r` ON `r`.`id_rol` = `ur`.`id_rol`
WHERE `ur`.`id_users` = '17'
 LIMIT 1
---
    public function searchUserPorfile($idUsuario)
    {
        return $this->db->table('tbl_user_rol ur')
            ->select('
            u.id_users,
            u.users_nombre,
            u.users_apellido,
            u.users_cedula,
            u.users_email,
            u.users_genero,
            u.users_nombreUsuario,
            u.users_telefono,
            u.users_fecha_de_nacimiento,
            u.users_estado,
            r.id_rol,
            r.rol_nombre
        ')
            ->join('tbl_users u', 'u.id_users = ur.id_users')
            ->join('tbl_rol r', 'r.id_rol = ur.id_rol')
            ->where('ur.id_users', $idUsuario)
            ->limit(1)
            ->get()
            ->getResult();